/**
Финансовая компания проводит исследование самых худших фондовых инвестиций и хотели бы приобрести программу, которая позволяет сделать это. 
Программа должна иметь возможность анализировать хронологический ряд фондовых цен для того, чтобы показать наибольший возможный размер _потери_, 
который возможен если купить долю в данный момент времени t0 и продать его на более поздний срок t1. Потери должны быть выражены в виде разницы между стоимостью в T0 и T1. 
Если потери нет - вывести 0.
Дано: массив произвольной длины, каждое значение которого есть стоимость акций в определенный момент времени.
Вывести на экран максимальное значение потери для этого массива. Расчет потери организовать в виде фукции, которая принимает массив в качестве параметра.
Проверочные данные:
3 2 4 2 1 5
max loss is 3

5 3 4 2 3 1
max loss is 4

*/

public class fin_loss		{
	public static void main(String[] args)	{
		int[] array = {3, 2, 4, 2, 1, 5, 10, 1};
		int maxloss = maxLoss(array);
		System.out.print("Max loss is " + maxloss);
	}
	public static int maxLoss(int[] array)	{
		int max = 0;
		for (int i=0; i<array.length; i++)	{
			for(int j=i+1; j <array.length; j++)	{
				int temp = array[i]-array[j];
				if (temp>max) max=temp;
			}
		}
		return max;
	}
	
	
}