/**
Напишите программу, которая получает из аргументов командной стоки расход бензина в европейском стиле (количество литров на 100 км) 
и преобразует его в стиль, принятый в США — число миль на галлон. Обратите внимание, что кроме использования других единиц измерений, 
принятый в США подход (расстояние/топливо) противоположен европейскому (топливо/расстояние). Учтите, что 100  километров соответствуют 62.14 милям, 
а 1 галлон составляет 3.875 литра. Таким образом, 19 миль на галлон примерно равно 12.4 литров на 100 км, а 27 миль на галлон — примерно 8.7 литров на 100 км. 

*/

public class homework9
{
	public static void main(String[] args) throws Exception
	{
		String sLitKm=args[0];
		int lit_km= Integer.parseInt(sLitKm); //расход топлива в понятной мне системе счисления литр/100км 
		
		double miles =62.1371/(lit_km*0.2642); //0,2642 - галлонов в одном литре
		
		System.out.println("*************************************************************");
		//при переводе в чуждую нам систему стисления (расстояние/топливо) в США у вас получится такие странные показатели (ха, ха): 
		System.out.println("when converted into the number system is alien to us \n(distance / fuel ratio) in the US you get such a strange performance (ha, ha):");
		System.out.printf("%.2f", miles); // подсмотрел как сделать красиво, как работает еще не понял 
		System.out.print(" miles/1 gallon\n");
		System.out.println("*************************************************************");
	}
}